#include <stdio.h>
#include <stdlib.h>

/* Η συνάρτηση collatz υπολογίζει το μήκος της ακολουθίας για κάθε ακεραιο χ. */
int collatz(long long x) {
    int seq = 0; // Αρχικοποίηση του μήκους της ακολουθίας σε 0.

    if (x < 1)
        return 0; // Εάν ο αριθμός είναι μικρότερος από 1, επιστροφή 0.
    else {
        while (x != 1) {
            if (x % 2 == 0)
                x = x / 2; // Περίπτωση όπου ο αριθμός είναι άρτιος.
            else
                x = 3 * x + 1; // Περίπτωση όπου ο αριθμός είναι περιττός.
            seq++; // Αύξηση του μήκους της ακολουθίας για κάθε επανάληψη.
        }
        seq++; // Συμπεριλαμβάνεται το τελικό '1' στην ακολουθία, εφόσον η επανάληψη τελειώνει για χ=1.
    }
    return seq; // Επιστροφή του συνολικού μήκους της ακολουθίας.
}

/* Η συνάρτηση max_sequence υπολογίζει το μέγιστο μήκος ακολουθίας εντός του εύρους αριθμών: {start εως end}. */
int max_sequence(long long start, long long end) {
    long long N;
    int max = 0; // Αρχικοποίηση του μέγιστου μήκους ακολουθίας σε 0.

    if (start > 0) { // Έλεγχος αν το εύρος αριθμών περιλαμβάνει μη θετικούς αριθμους.

        for (N = start; N <= end; N++) {
            int t_collatz = collatz(N); // Αποθήκευση της τιμής 'collatz(N)' με μια μεταβλιτή.
            if (max < t_collatz) {
                max = t_collatz; // Ενημερώνεται το 'max' εάν βρεθεί μια μεγαλύτερη ακολουθία.
            }
        } // Αν δοθούν μη έγκυροι αριθμοί, το max παραμενει αμετάβλητο και η συναρτηση max_sequence επιστρέφει 0
    }
    return max; // Επιστροφή του μέγιστου μήκους ακολουθίας που βρέθηκε εντός του εύρους.
}

int main(int argc, char **argv) { // (input).

    if (argc != 3) { // Έλεγχος του αριθμού των ορισμάτων γραμμής εντολής.
        printf("Λάθος πλήθος ορισμάτων!\n");
        printf("Σωστή σύνταξη: ./collatz <n1> <n2> \n");
        return 1; // Επιστροφή 1 για υπόδειξη σφάλματος.
    }

   long long start = atoll(argv[1]);
   long long end = atoll(argv[2]);

    printf("%d\n", max_sequence(start, end)); // Εκτύπωση του μέγιστου μήκους ακολουθίας (output).
    return 0; // Επιστροφή 0 για υπόδειξη επιτυχής εκτέλεσης του προγράμματος.
}
